#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mmodule.sns_topic_video_load.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_status.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_vpc.frameFlowVpc: Refreshing state... [id=vpc-02af2381db6d9e4df][0m
[0m[1maws_s3_bucket.original: Refreshing state... [id=original-video-bucket][0m
[0m[1maws_sqs_queue_policy.sns_to_sqs_video_alter_status: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-alter-status-queue.fifo][0m
[0m[1mmodule.sns_topic_video_status.aws_sns_topic.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo][0m
[0m[1maws_sqs_queue_policy.sns_to_sqs_video_notification_status: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-notification-queue.fifo][0m
[0m[1maws_sqs_queue.video_status_queue_notification: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-notification-queue.fifo][0m
[0m[1maws_sqs_queue.video_status_queue_alter_status: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-alter-status-queue.fifo][0m
[0m[1maws_ecr_repository.foo: Refreshing state... [id=frameflow-ecr][0m
[0m[1mmodule.sns_topic_video_status.data.aws_caller_identity.current: Read complete after 0s [id=090111931170][0m
[0m[1maws_s3_bucket.frames: Refreshing state... [id=frames-video-bucket][0m
[0m[1mmodule.sns_topic_video_load.data.aws_caller_identity.current: Read complete after 0s [id=090111931170][0m
[0m[1mmodule.sns_topic_video_load.aws_sns_topic.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-carregado-topic.fifo][0m
[0m[1mdata.aws_iam_role.frameFlowIamRole: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_status.aws_sns_topic_subscription.this["sqsNotificationStatus"]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo:bc989901-2181-4970-b0ff-89537791828d][0m
[0m[1mmodule.sns_topic_video_status.aws_sns_topic_subscription.this["sqsAlterStatus"]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo:82039be3-cd31-48db-a6ce-a6a11cbe8eb1][0m
[0m[1mmodule.sns_topic_video_status.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_status.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3224713887][0m
[0m[1mmodule.sns_topic_video_status.aws_sns_topic_policy.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo][0m
[0m[1mmodule.sns_topic_video_load.aws_sns_topic_subscription.this["sqs"]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-carregado-topic.fifo:0c24d96d-7a57-4f4a-acad-10b4688e4a17][0m
[0m[1mmodule.sns_topic_video_load.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.sns_topic_video_load.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3365586441][0m
[0m[1mmodule.sns_topic_video_load.aws_sns_topic_policy.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:090111931170:video-carregado-topic.fifo][0m
[0m[1mdata.aws_iam_role.frameFlowIamRole: Read complete after 0s [id=LabRole][0m
[0m[1maws_sqs_queue.video_load_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/090111931170/video-carregado-subscriber-queue.fifo][0m
[0m[1maws_sqs_queue_policy.sns_to_sqs_video_load: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/090111931170/video-carregado-subscriber-queue.fifo][0m
[0m[1maws_internet_gateway.myIgw: Refreshing state... [id=igw-0ef268167c52d73a9][0m
[0m[1maws_subnet.subnetA: Refreshing state... [id=subnet-0eebd3b6e2b4dea1c][0m
[0m[1maws_subnet.subnetB: Refreshing state... [id=subnet-00fe77aa93b468fd5][0m
[0m[1maws_security_group.clusterSG: Refreshing state... [id=sg-02b067c18cbb204fe][0m
[0m[1maws_route_table.RTApp: Refreshing state... [id=rtb-0e0ee2d1e10377a5e][0m
[0m[1maws_route_table_association.publicRTAssociationB: Refreshing state... [id=rtbassoc-06e177bde99a4fefe][0m
[0m[1maws_route_table_association.RTAssociationA: Refreshing state... [id=rtbassoc-032083273c0fde8d1][0m
[0m[1maws_eks_cluster.frameFlowEksCluster: Refreshing state... [id=frameFlow-eks-cluster][0m
[0m[1maws_eks_access_policy_association.example: Refreshing state... [id=frameFlow-eks-cluster#arn:aws:iam::090111931170:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1maws_eks_access_entry.access: Refreshing state... [id=frameFlow-eks-cluster:arn:aws:iam::090111931170:role/voclabs][0m
[0m[1maws_eks_node_group.fiap51BurguerNode: Refreshing state... [id=frameFlow-eks-cluster:frameFlow-node][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # aws_ecr_repository.foo[0m will be [1m[31mdestroyed[0m
  # (because aws_ecr_repository.foo is not in configuration)
[0m  [31m-[0m[0m resource "aws_ecr_repository" "foo" {
      [31m-[0m[0m arn                  = "arn:aws:ecr:us-east-1:090111931170:repository/frameflow-ecr" [90m-> null[0m[0m
      [31m-[0m[0m id                   = "frameflow-ecr" [90m-> null[0m[0m
      [31m-[0m[0m image_tag_mutability = "MUTABLE" [90m-> null[0m[0m
      [31m-[0m[0m name                 = "frameflow-ecr" [90m-> null[0m[0m
      [31m-[0m[0m registry_id          = "090111931170" [90m-> null[0m[0m
      [31m-[0m[0m repository_url       = "090111931170.dkr.ecr.us-east-1.amazonaws.com/frameflow-ecr" [90m-> null[0m[0m
      [31m-[0m[0m tags                 = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all             = {} [90m-> null[0m[0m

      [31m-[0m[0m encryption_configuration {
          [31m-[0m[0m encryption_type = "AES256" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [31m-[0m[0m image_scanning_configuration {
          [31m-[0m[0m scan_on_push = true [90m-> null[0m[0m
        }
    }

[1m  # aws_sqs_queue.video_load_queue[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_sqs_queue" "video_load_queue" {
        id                                = "https://sqs.us-east-1.amazonaws.com/090111931170/video-carregado-subscriber-queue.fifo"
        name                              = "video-carregado-subscriber-queue.fifo"
        tags                              = {}
      [33m~[0m[0m visibility_timeout_seconds        = 1800 [33m->[0m[0m 30
        [90m# (18 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_sqs_queue.video_status_queue[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue" "video_status_queue" {
      [32m+[0m[0m arn                               = (known after apply)
      [32m+[0m[0m content_based_deduplication       = false
      [32m+[0m[0m deduplication_scope               = (known after apply)
      [32m+[0m[0m delay_seconds                     = 0
      [32m+[0m[0m fifo_queue                        = true
      [32m+[0m[0m fifo_throughput_limit             = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m kms_data_key_reuse_period_seconds = (known after apply)
      [32m+[0m[0m max_message_size                  = 262144
      [32m+[0m[0m message_retention_seconds         = 345600
      [32m+[0m[0m name                              = "video-status-subscriber-queue.fifo"
      [32m+[0m[0m name_prefix                       = (known after apply)
      [32m+[0m[0m policy                            = (known after apply)
      [32m+[0m[0m receive_wait_time_seconds         = 0
      [32m+[0m[0m redrive_allow_policy              = (known after apply)
      [32m+[0m[0m redrive_policy                    = (known after apply)
      [32m+[0m[0m sqs_managed_sse_enabled           = (known after apply)
      [32m+[0m[0m tags_all                          = (known after apply)
      [32m+[0m[0m url                               = (known after apply)
      [32m+[0m[0m visibility_timeout_seconds        = 30
    }

[1m  # aws_sqs_queue.video_status_queue_alter_status[0m will be [1m[31mdestroyed[0m
  # (because aws_sqs_queue.video_status_queue_alter_status is not in configuration)
[0m  [31m-[0m[0m resource "aws_sqs_queue" "video_status_queue_alter_status" {
      [31m-[0m[0m arn                               = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m content_based_deduplication       = false [90m-> null[0m[0m
      [31m-[0m[0m deduplication_scope               = "queue" [90m-> null[0m[0m
      [31m-[0m[0m delay_seconds                     = 0 [90m-> null[0m[0m
      [31m-[0m[0m fifo_queue                        = true [90m-> null[0m[0m
      [31m-[0m[0m fifo_throughput_limit             = "perQueue" [90m-> null[0m[0m
      [31m-[0m[0m id                                = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m kms_data_key_reuse_period_seconds = 300 [90m-> null[0m[0m
      [31m-[0m[0m max_message_size                  = 262144 [90m-> null[0m[0m
      [31m-[0m[0m message_retention_seconds         = 345600 [90m-> null[0m[0m
      [31m-[0m[0m name                              = "video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m receive_wait_time_seconds         = 0 [90m-> null[0m[0m
      [31m-[0m[0m sqs_managed_sse_enabled           = true [90m-> null[0m[0m
      [31m-[0m[0m tags_all                          = {} [90m-> null[0m[0m
      [31m-[0m[0m url                               = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m visibility_timeout_seconds        = 30 [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_sqs_queue.video_status_queue_notification[0m will be [1m[31mdestroyed[0m
  # (because aws_sqs_queue.video_status_queue_notification is not in configuration)
[0m  [31m-[0m[0m resource "aws_sqs_queue" "video_status_queue_notification" {
      [31m-[0m[0m arn                               = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m content_based_deduplication       = false [90m-> null[0m[0m
      [31m-[0m[0m deduplication_scope               = "queue" [90m-> null[0m[0m
      [31m-[0m[0m delay_seconds                     = 0 [90m-> null[0m[0m
      [31m-[0m[0m fifo_queue                        = true [90m-> null[0m[0m
      [31m-[0m[0m fifo_throughput_limit             = "perQueue" [90m-> null[0m[0m
      [31m-[0m[0m id                                = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m kms_data_key_reuse_period_seconds = 300 [90m-> null[0m[0m
      [31m-[0m[0m max_message_size                  = 262144 [90m-> null[0m[0m
      [31m-[0m[0m message_retention_seconds         = 345600 [90m-> null[0m[0m
      [31m-[0m[0m name                              = "video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m receive_wait_time_seconds         = 0 [90m-> null[0m[0m
      [31m-[0m[0m sqs_managed_sse_enabled           = true [90m-> null[0m[0m
      [31m-[0m[0m tags_all                          = {} [90m-> null[0m[0m
      [31m-[0m[0m url                               = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m visibility_timeout_seconds        = 30 [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_sqs_queue_policy.sns_to_sqs_video_alter_status[0m will be [1m[31mdestroyed[0m
  # (because aws_sqs_queue_policy.sns_to_sqs_video_alter_status is not in configuration)
[0m  [31m-[0m[0m resource "aws_sqs_queue_policy" "sns_to_sqs_video_alter_status" {
      [31m-[0m[0m id        = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m policy    = jsonencode(
            {
              [31m-[0m[0m Id        = "__default_policy_ID"
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "SQS:*"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::090111931170:root"
                        }
                      [31m-[0m[0m Resource  = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-alter-status-queue.fifo"
                      [31m-[0m[0m Sid       = "__owner_statement"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "SQS:SendMessage"
                      [31m-[0m[0m Condition = {
                          [31m-[0m[0m ArnLike = {
                              [31m-[0m[0m "aws:SourceArn" = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
                            }
                        }
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "*"
                        }
                      [31m-[0m[0m Resource  = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-alter-status-queue.fifo"
                      [31m-[0m[0m Sid       = "topic-subscription-arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m queue_url = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
    }

[1m  # aws_sqs_queue_policy.sns_to_sqs_video_notification_status[0m will be [1m[31mdestroyed[0m
  # (because aws_sqs_queue_policy.sns_to_sqs_video_notification_status is not in configuration)
[0m  [31m-[0m[0m resource "aws_sqs_queue_policy" "sns_to_sqs_video_notification_status" {
      [31m-[0m[0m id        = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m policy    = jsonencode(
            {
              [31m-[0m[0m Id        = "__default_policy_ID"
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "SQS:*"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::090111931170:root"
                        }
                      [31m-[0m[0m Resource  = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-notification-queue.fifo"
                      [31m-[0m[0m Sid       = "__owner_statement"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "SQS:SendMessage"
                      [31m-[0m[0m Condition = {
                          [31m-[0m[0m ArnLike = {
                              [31m-[0m[0m "aws:SourceArn" = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
                            }
                        }
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "*"
                        }
                      [31m-[0m[0m Resource  = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-notification-queue.fifo"
                      [31m-[0m[0m Sid       = "topic-subscription-arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m queue_url = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
    }

[1m  # aws_sqs_queue_policy.sns_to_sqs_video_status[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue_policy" "sns_to_sqs_video_status" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m policy    = jsonencode(
            {
              [32m+[0m[0m Id        = "__default_policy_ID"
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "SQS:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "arn:aws:iam::090111931170:root"
                        }
                      [32m+[0m[0m Resource  = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-queue.fifo"
                      [32m+[0m[0m Sid       = "__owner_statement"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "SQS:SendMessage"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m ArnLike = {
                              [32m+[0m[0m "aws:SourceArn" = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "*"
                        }
                      [32m+[0m[0m Resource  = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-queue.fifo"
                      [32m+[0m[0m Sid       = "topic-subscription-arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m queue_url = "https://sqs.us-east-1.amazonaws.com/090111931170/video-status-subscriber-queue.fifo"
    }

[1m  # module.sns_topic_video_status.aws_sns_topic_subscription.this["sqs"][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_subscription" "this" {
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m confirmation_timeout_in_minutes = 1
      [32m+[0m[0m confirmation_was_authenticated  = (known after apply)
      [32m+[0m[0m endpoint                        = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-queue.fifo"
      [32m+[0m[0m endpoint_auto_confirms          = false
      [32m+[0m[0m filter_policy_scope             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m owner_id                        = (known after apply)
      [32m+[0m[0m pending_confirmation            = (known after apply)
      [32m+[0m[0m protocol                        = "sqs"
      [32m+[0m[0m raw_message_delivery            = false
      [32m+[0m[0m topic_arn                       = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo"
    }

[1m  # module.sns_topic_video_status.aws_sns_topic_subscription.this["sqsAlterStatus"][0m will be [1m[31mdestroyed[0m
  # (because key ["sqsAlterStatus"] is not in for_each map)
[0m  [31m-[0m[0m resource "aws_sns_topic_subscription" "this" {
      [31m-[0m[0m arn                             = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo:82039be3-cd31-48db-a6ce-a6a11cbe8eb1" [90m-> null[0m[0m
      [31m-[0m[0m confirmation_timeout_in_minutes = 1 [90m-> null[0m[0m
      [31m-[0m[0m confirmation_was_authenticated  = true [90m-> null[0m[0m
      [31m-[0m[0m endpoint                        = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-notification-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m endpoint_auto_confirms          = false [90m-> null[0m[0m
      [31m-[0m[0m id                              = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo:82039be3-cd31-48db-a6ce-a6a11cbe8eb1" [90m-> null[0m[0m
      [31m-[0m[0m owner_id                        = "090111931170" [90m-> null[0m[0m
      [31m-[0m[0m pending_confirmation            = false [90m-> null[0m[0m
      [31m-[0m[0m protocol                        = "sqs" [90m-> null[0m[0m
      [31m-[0m[0m raw_message_delivery            = false [90m-> null[0m[0m
      [31m-[0m[0m topic_arn                       = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo" [90m-> null[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.sns_topic_video_status.aws_sns_topic_subscription.this["sqsNotificationStatus"][0m will be [1m[31mdestroyed[0m
  # (because key ["sqsNotificationStatus"] is not in for_each map)
[0m  [31m-[0m[0m resource "aws_sns_topic_subscription" "this" {
      [31m-[0m[0m arn                             = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo:bc989901-2181-4970-b0ff-89537791828d" [90m-> null[0m[0m
      [31m-[0m[0m confirmation_timeout_in_minutes = 1 [90m-> null[0m[0m
      [31m-[0m[0m confirmation_was_authenticated  = true [90m-> null[0m[0m
      [31m-[0m[0m endpoint                        = "arn:aws:sqs:us-east-1:090111931170:video-status-subscriber-alter-status-queue.fifo" [90m-> null[0m[0m
      [31m-[0m[0m endpoint_auto_confirms          = false [90m-> null[0m[0m
      [31m-[0m[0m id                              = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo:bc989901-2181-4970-b0ff-89537791828d" [90m-> null[0m[0m
      [31m-[0m[0m owner_id                        = "090111931170" [90m-> null[0m[0m
      [31m-[0m[0m pending_confirmation            = false [90m-> null[0m[0m
      [31m-[0m[0m protocol                        = "sqs" [90m-> null[0m[0m
      [31m-[0m[0m raw_message_delivery            = false [90m-> null[0m[0m
      [31m-[0m[0m topic_arn                       = "arn:aws:sns:us-east-1:090111931170:video-status-topic.fifo" [90m-> null[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 3 to add, 1 to change, 7 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @GuiMM, Action: `pull_request`*